app/controllers/books_controller.rb

  def create
    @book = Book.new(params[:book])

    if @book.save
---
INSERT INTO `books` (`created_at`, `updated_at`) VALUES ('2013-09-26 10:05:38', '2013-09-26 10:05:38')

  def destroy
    @book = Book.find(params[:id])
    @book.destroy
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 2 LIMIT 1
DELETE FROM `books` WHERE `books`.`id` = 2